text_1 = '=' * 27 + '\nВыберите поисковую машину: \n' + '=' * 27
text_2 = '=' * 29 + '\nКоличество требуемых ссылок: \n' + '=' * 29
text_3 = '=' * 26 + '\n     Глубина поиска: \n' + '=' * 26
text_4 = '=' * 26 + '\n     Введите текст зароса: \n' + '=' * 26

text_choose_engine = "Введите латинские буквы: Y для Яндекса, G для Гугла, B - если нужны оба поисковика:\n "
text_quantity_links = "Введите количество необходимых ссылок (в диапазоне от 1 до 50):\n "
text_search_depth = "Введите 1 если неообходимо собрать ссылки с найденных ресурсов. \n" \
                    "или 0 если дополнительные ссылки не требуются \n"

text_search_query = " Максимум 48 символов включая пробелы:\n "

search_engines_dict = {'y': 'yandex',
                       'н': 'yandex',
                       'g': 'google',
                       'п': 'google',
                       'b': 'both',
                       'и': 'both'
                       }
