text_1 = '\n   Выберите поисковую машину'
text_2 = '\n   Задайте глубину поиска'
text_3 = '\n   Удалить повторы'

text_choose_engine = "Введите латинские буквы: Y для Яндекса, G для Гугла, B - если нужны оба поисковика:\n "
text_quantity_links = "Введите количество необходимых ссылок (в диапазооне от 1 до 50):\n "
text_double_links = "Введите латинские буквы: Y если Вы хотите удалить повторы, " \
                    "N если хотите оставить повтоорящющиеся ссылки "

search_engines_dict = {'yandex': 'y',
                       'google': 'g',
                       'both': 'b'}
