text_1 = '='*26 + '\nВыберите поисковую машину: \n'+'='*26
text_2 = '='*26 + '\n   Задайте глубину поиска: \n'+'='*26
text_3 = '='*26 + '\n     Введите текст зароса: \n'+'='*26

text_choose_engine = "Введите латинские буквы: Y для Яндекса, G для Гугла, B - если нужны оба поисковика:\n "
text_quantity_links = "Введите количество необходимых ссылок (в диапазоне от 1 до 50):\n "
text_search_query = " Максимум 48 символов включая пробелы:\n "

search_engines_dict = {'yandex': 'y',
                       'google': 'g',
                       'both': 'b'}
